In [9]:
import pymysql
import pandas as pd
import sqlalchemy as alch

In [10]:
import os
from dotenv import load_dotenv 
load_dotenv()

True

In [11]:
sql_password = os.getenv("SQL_password")

In [12]:
dbName = "women_representation"
connectionData=f"mysql+pymysql://root:{sql_password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

In [ ]:
query = '''

'''

pd.read_sql_query(query, engine)

In [ ]:
# 1
#percentage of each b_score
#also depending on year

In [ ]:
# 2
# best producing companies

In [ ]:
# 3
#relation btw b_score and incassi/votazione

In [ ]:
# 4
#correlation btw b_score and cast/crew gender

In [ ]:
# 5
#budget per film con regista/produttrice donna

In [ ]:
#1

In [14]:
# percentuale di film per ogni bechdel score
query = '''
SELECT bt_score AS Bechdel_score,
       COUNT(*) * 100.0 / (SELECT COUNT(*) FROM movies) AS percentage
FROM movies
GROUP BY bt_score
'''

pd.read_sql_query(query, engine)

   Bechdel_score  percentage
0            0.0    10.40081
1            1.0    22.79300
2            3.0    56.48148
3            2.0    10.32471

In [15]:
# percentuale di film nel corso degli anni per ogni bechdel score
query = '''
SELECT 
    release_year,
    SUM(CASE WHEN bt_score = 0 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt0_percentage,
    SUM(CASE WHEN bt_score = 1 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt1_percentage,
    SUM(CASE WHEN bt_score = 2 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt2_percentage,
    SUM(CASE WHEN bt_score = 3 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt3_percentage,
    COUNT(*) AS num_movies
FROM (SELECT title, bt_score, YEAR(STR_TO_DATE(release_date, '%%d/%%m/%%Y')) AS release_year
FROM movies) AS tab
GROUP BY release_year
ORDER BY release_year DESC;
'''

pd.read_sql_query(query, engine)

,release_year,bt0_percentage,bt1_percentage,bt2_percentage,bt3_percentage,num_movies
0,2022,3.4783,19.1304,8.6957,68.6957,115
1,2021,5.5556,16.1111,8.3333,70.0000,180
2,2020,6.4103,13.4615,7.0513,73.0769,156
3,2019,7.4534,21.7391,4.9689,65.8385,161
4,2018,50.0000,50.0000,0.0000,0.0000,4
...,...,...,...,...,...,...
122,1893,100.0000,0.0000,0.0000,0.0000,1
123,1891,100.0000,0.0000,0.0000,0.0000,2
124,1890,100.0000,0.0000,0.0000,0.0000,3
125,1888,100.0000,0.0000,0.0000,0.0000,1
126,1878,100.0000,0.0000,0.0000,0.0000,1

In [16]:
# percentuale di film nel corso dei decenni per ogni bechdel score
query = '''
SELECT 
    FLOOR(release_year / 10) * 10 AS decade,
    SUM(CASE WHEN bt_score = 0 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt0_percentage,
    SUM(CASE WHEN bt_score = 1 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt1_percentage,
    SUM(CASE WHEN bt_score = 2 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt2_percentage,
    SUM(CASE WHEN bt_score = 3 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt3_percentage,
    COUNT(*) AS num_movies
FROM (
    SELECT 
        title, 
        bt_score, 
        FLOOR(YEAR(STR_TO_DATE(release_date, '%%d/%%m/%%Y')) / 10) * 10 AS release_year
    FROM movies
) AS tab
GROUP BY decade
HAVING num_movies>100
ORDER BY decade DESC;
'''

pd.read_sql_query(query, engine)

,decade,bt0_percentage,bt1_percentage,bt2_percentage,bt3_percentage,num_movies
0,2020.0,5.3215,15.9645,7.9823,70.7317,451
1,2010.0,7.2395,21.7184,9.1488,61.8934,2514
2,2000.0,8.3832,23.3533,9.3087,58.9548,1837
3,1990.0,8.5832,25.9566,10.4447,55.0155,967
4,1980.0,14.1005,23.6629,11.8314,50.4052,617
5,1970.0,15.0510,29.5918,11.2245,44.1327,392
6,1960.0,18.8791,26.2537,10.6195,44.2478,339
7,1950.0,14.5594,22.2222,15.3257,47.8927,261
8,1940.0,16.9082,20.2899,14.9758,47.8261,207
9,1930.0,10.9195,20.6897,18.9655,49.4253,174

In [ ]:
#2

In [17]:
# percentuale di film per producing companies per ogni bechdel score
query = '''
SELECT 
    production_companies,
    SUM(CASE WHEN bt_score = 0 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt0_percentage,
    SUM(CASE WHEN bt_score = 1 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt1_percentage,
    SUM(CASE WHEN bt_score = 2 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt2_percentage,
    SUM(CASE WHEN bt_score = 3 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt3_percentage,
    COUNT(*) AS num_movies
FROM (SELECT production_companies.title, bt_score, production_companies
FROM production_companies
JOIN movies ON production_companies.imdbid = movies.imdbid) AS tab
GROUP BY production_companies
HAVING num_movies > 20
ORDER BY bt3_percentage DESC;
'''

pd.read_sql_query(query, engine)

,production_companies,bt0_percentage,bt1_percentage,bt2_percentage,bt3_percentage,num_movies
0,"['Victoires Productions', 'Constellation Produ...",0.0000,0.0000,0.0000,100.0000,21
1,"['Lantia Cinema & Audiovisivi', 'Fine Line Fea...",0.0000,0.0000,0.0000,100.0000,26
2,"['YLE', 'Zentropa Entertainments', 'DR', 'Trol...",0.0000,0.0000,0.0000,100.0000,22
3,"['Eurimages', 'Motion Investment Group', 'Arca...",0.0000,0.0000,0.0000,100.0000,21
4,"['Motlys', 'Coproduction Office', 'Film i Väst...",0.0000,0.0000,0.0000,100.0000,24
5,"['Ciclic - Région Centre', 'Angoa-Agicoa', 'ME...",0.0000,0.0000,0.0000,100.0000,22
6,['RKO Radio Pictures'],17.1429,11.4286,14.2857,57.1429,35
7,['Columbia Pictures'],7.2727,25.4545,12.7273,54.5455,55
8,['20th Century Fox'],15.7143,17.1429,14.2857,52.8571,70
9,['New Line Cinema'],0.0000,23.8095,23.8095,52.3810,21
10,['Paramount'],5.4348,22.8261,19.5652,52.1739,92
11,['Warner Bros. Pictures'],6.9767,26.7442,16.2791,50.0000,86
12,"['Blue Sky Studios', '20th Century Fox Animati...",0.0000,37.5000,12.5000,50.0000,24
13,['Metro-Goldwyn-Mayer'],7.6190,21.9048,20.9524,49.5238,105
14,['Universal Pictures'],9.2308,18.4615,23.0769,49.2308,65
15,['Walt Disney Productions'],13.5135,27.0270,13.5135,45.9459,37
16,['Toho'],23.8095,28.5714,9.5238,38.0952,21
17,"['Pixar', 'Walt Disney Pictures']",0.0000,45.4545,18.1818,36.3636,22
18,"['United Artists', 'Eon Productions', 'Danjaq']",0.0000,75.0000,0.0000,25.0000,24
19,"['Det Danske Filminstitut', 'Angoa-Agicoa', 'P...",0.0000,100.0000,0.0000,0.0000,26

In [21]:
# producing company - average budget - average budget b_score=3
query = '''
SELECT 
    production_company,
    AVG(budget)/1000000 AS avg_Mbudget,
    AVG(CASE WHEN bt_score = 3 THEN budget ELSE NULL END)/1000000 AS avg_Mbudget_bt3,
    COUNT(*) AS num_movies
FROM (SELECT production_companies.title, bt_score, production_company, budget
FROM production_companies
JOIN movies ON production_companies.imdbid = movies.imdbid
WHERE budget>0) AS tab
GROUP BY production_company
HAVING num_movies > 50
ORDER BY avg_Mbudget_bt3-avg_Mbudget DESC; 
'''

# ordino mettendo per prime le producing company con maggiore differenza tra budget per bt_score3 e budget 
pd.read_sql_query(query, engine)

           production_company  avg_Mbudget  avg_Mbudget_bt3  num_movies
0        Walt Disney Pictures    96.464051       104.523750         136
1            20th Century Fox    39.251741        41.477008         251
2         DreamWorks Pictures    63.608974        65.236111          78
3              Focus Features    19.628365        20.953125          52
4        Summit Entertainment    44.575070        45.658111          57
5         Working Title Films    29.557170        30.364687          53
6       Warner Bros. Pictures    56.826581        57.273100         367
7   Village Roadshow Pictures    77.922388        77.787879          67
8                 StudioCanal    28.976586        28.140244          57
9                   Lionsgate    36.649534        35.527719          80
10         Universal Pictures    44.392602        42.388714         356
11            New Line Cinema    39.549014        37.474513         140
12             United Artists    13.783820        11.595377         104
13                  Paramount    45.803612        43.559615         267
14                    Miramax    25.045439        22.279412          79
15           TriStar Pictures    34.993846        32.072222          65
16                     Canal+    19.394080        16.145198         102
17          Columbia Pictures    51.324902        47.655492         266
18           Relativity Media    55.610465        47.723404          86
19        Regency Enterprises    46.740103        38.017977          52
20        Metro-Goldwyn-Mayer    35.230173        25.010214         151
21        Touchstone Pictures    44.968945        29.300000          81

In [ ]:
# 3

In [22]:
# Average of film popularity for each bechdel test value
query = '''
SELECT bt_score AS Bechdel_score, AVG(popularity) AS Average_Popularity
FROM movies
GROUP BY bt_score

'''

pd.read_sql_query(query, engine)

   Bechdel_score  Average_Popularity
0            0.0           15.000771
1            1.0           22.016504
2            3.0           19.529125
3            2.0           19.576235

In [23]:
# Average of revenues for each bechdel test value
query = '''
SELECT bt_score AS Bechdel_score, AVG(revenue)/1000000 AS Average_M_Revenue
FROM movies
GROUP BY bt_score

'''

pd.read_sql_query(query, engine)

   Bechdel_score  Average_M_Revenue
0            0.0          37.158965
1            1.0          67.981083
2            3.0          56.484784
3            2.0          60.231770

In [ ]:
# 4

In [24]:
# correlation btw b_score and cast gender
query = '''
SELECT     (
        COUNT(*) * SUM(female_ratio * bt_score) - SUM(female_ratio) * SUM(bt_score)
    ) / SQRT(
        (COUNT(*) * SUM(female_ratio * bt_score) - SUM(female_ratio) * SUM(female_ratio)) *
        (COUNT(*) * SUM(bt_score * bt_score) - SUM(bt_score) * SUM(bt_score))
    ) AS correlation
FROM 
(SELECT cast.title, female_cast_count/num_actors AS female_ratio, bt_score FROM cast
JOIN movies on cast.imdbid=movies.imdbid) AS tab

'''

pd.read_sql_query(query, engine)

   correlation
0     0.086482

In [25]:
#correlation btw b_score and crew gender
query = '''
SELECT     (
        COUNT(*) * SUM(female_ratio * bt_score) - SUM(female_ratio) * SUM(bt_score)
    ) / SQRT(
        (COUNT(*) * SUM(female_ratio * bt_score) - SUM(female_ratio) * SUM(female_ratio)) *
        (COUNT(*) * SUM(bt_score * bt_score) - SUM(bt_score) * SUM(bt_score))
    ) AS correlation
FROM 
(SELECT crew.title, female_crew/num_crew AS female_ratio, bt_score FROM crew
JOIN movies on crew.imdbid=movies.imdbid) AS tab

'''

pd.read_sql_query(query, engine)

   correlation
0     0.050732

In [26]:
#
query = '''
SELECT bt_score AS Bechdel_score,
       AVG(female_ratio) AS avg_fem_ratio,
       AVG(male_ratio) AS avg_mal_ration,
       AVG(nonbinary_ratio) AS avg_nbin_ratio       
FROM (
SELECT crew.title, bt_score, female_crew/num_crew AS female_ratio, male_crew/num_crew AS male_ratio,nonbinary_crew/num_crew AS nonbinary_ratio
FROM crew
JOIN movies on crew.imdbid=movies.imdbid) AS tab
GROUP BY bt_score
'''

pd.read_sql_query(query, engine)

   Bechdel_score  avg_fem_ratio  avg_mal_ration  avg_nbin_ratio
0            0.0       0.075569        0.528438        0.000058
1            1.0       0.103983        0.492719        0.000036
2            3.0       0.151661        0.441052        0.000222
3            2.0       0.110115        0.508793        0.000137

In [ ]:
 # non si arriva a 100 perche c'erano anche valori unknown

In [ ]:
# 5
# budget per film con regista/produttrice donna

In [ ]:
# 6
# is it more likely for a woman to win an oscar if the bechdel test score is higher?